Revit 2027 API
Reference.UVPoint Property
The UV parameters of the reference, if the reference contains a face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UV UVPoint { get; }
Public ReadOnly Property UVPoint As UV
	Get
public:
property UV^ UVPoint {
	UV^ get ();
}
member UVPoint : UV with get
Property Value
UV
Remarks
This value is valid only for references of type REFERENCE_TYPE_SURFACE. It is null for all other types.
See Also
Reference
Reference Class
Autodesk.Revit.DB Namespace